#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.KEYCLOAK_DEV.module.moh_applications.module.ORGANIZATIONS-API.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      + exclude_session_state_from_auth_response   = false
        id                                         = "e80136f5-76d2-4286-bde2-ea835b0e2b64"
      ~ use_refresh_tokens                         = false -> true
        # (21 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ORGANIZATIONS-API.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "BEARER-ONLY"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "ORGANIZATIONS-API"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Created for AB#6120: Develop Organization APIs"
      + direct_access_grants_enabled              = true
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ORGANIZATIONS-API.module.client-roles.keycloak_role.ROLES["add-org"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "add-org"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ORGANIZATIONS-API.module.client-roles.keycloak_role.ROLES["get-org"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "get-org"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["ORGANIZATIONS-API/add-org"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["ORGANIZATIONS-API/get-org"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["ORGANIZATIONS-API/add-org"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "add-org"
      + service_account_user_id = "a0112432-6122-4208-98b9-c3e4de346e18"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["ORGANIZATIONS-API/get-org"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "get-org"
      + service_account_user_id = "a0112432-6122-4208-98b9-c3e4de346e18"
    }

Plan: 7 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*